---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.WallFailures
source: html/6ca5f49d-5d81-745c-5ddc-4f56a0c0ca35.htm
---
# BuiltInFailures.WallFailures Properties

Changing the type of a subwall is not allowed. Edit the stacked wall type instead.